---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.MultiServerService
source: html/ac0494f1-bd1c-4596-e2bf-eec3ac36e3b4.htm
---
# Autodesk.Revit.DB.ExternalService.MultiServerService

This class represents a multi-server service inside Revit application.
 It is created when an instance of IMultiServerService is registered with Revit.

## Syntax (C#)
```csharp
public class MultiServerService : ExternalService
```